#pragma once

#include <string>
#include <vector>

/**
 * \interface IConsoleUtils
 * \brief Інтерфейс для класу, що відповідає за відображення графічного інтерфейсу в консолі.
 *
 * Забезпечує консольне виведення вікна авторизації та меню.
 * Це дозволяє створювати різні реалізації інтерфейсу для конкретних потреб.
 */
class IConsoleUtils {
public:
#pragma region Destructor
    /**
     * \brief Віртуальний деструктор.
     *
     * Деструктор має бути віртуальним для коректного видалення об'єктів на основі цього інтерфейсу.
     */
    virtual ~IConsoleUtils() = default;
#pragma endregion

#pragma region Methods
    /**
     * \brief Відображає вікно авторизації в консолі.
     *
     * Це вікно дозволяє користувачеві ввести свій логін і пароль. Після того, як користувач
     * натискає кнопку "Start", метод повертає пару логін-пароль.
     *
     * \return Пара з логіна і пароля, введених користувачем.
     */
    virtual std::pair<std::string, std::string> showLoginWindow() = 0;
    /**
     * \brief Відображає меню з варіантами вибору в консолі.
     *
     * Відображає меню з варіантами, переданими в параметрі `entries`. Після того, як
     * користувач вибирає пункт меню, метод повертає індекс вибраного пункту.
     *
     * \param entries Список пунктів меню, з яких користувач може вибрати.
     * \return Індекс вибраного пункту (починаючи з 1).
     */
    virtual int showMenuWindow(const std::vector<std::string>& entries) = 0;
#pragma endregion
};
